/*
    Якщо користувач вводить «Ім’я», то питати пароль, 
    якщо натиснув скасувати(escape) - виводити «Вхід скасований», 
    якщо вводить щось інше - «Я вас не знаю».

    Пароль перевіряти так. Якщо введений пароль «ЛОГОС», то виводити «Ласкаво просимо!», Інакше - «Пароль невірний», 
    при скасуванні - «Вхід скасований».
*/
let name;
let password;

alert('Вхід в обліковий запис');

name = prompt('Вкажіть кодове слово', '');
if (name == 'Ім\'я') {
    password = prompt('Введіть пароль для входу', '');
    if (password == 'ЛОГОС') {
        alert('Ласкаво просимо!');
    } else if (password === null) {
        alert('Вхід скасований');
    } else {
        alert('Пароль невірний');
    };
} else if (name === null) {
    alert('Вхід скасований');
} else {
    alert('Я вас не знаю');
};
